import pandas as pd


def read():
    #df = pd.read_excel("c:\\tmp\\20190919-133457-zhanghui.txt")
    '''a = ["所属域", "系统名称", "机房", "机架", "设备存放位置", "所属应用系统", "主机用途", "P / N", "序列号", "型号描述", "配置项名称", "IP地址", "掩码", "网关",
         "管理卡地址", "配置项分类", "搜索代码", "配置项标识", "备注", "设备名称", "资产编号", "使用状态", "维保厂家", "维保联系人", "维保有效期至", "维保联系电话", "区域",
         "购置日期", "电口网卡数量", "出保日期", "是否与其他系统共用", "CPU情况", "CPU型号", "CPU主频", "CPU类型", "数据库版本", "品牌类型", "硬盘信息", "硬盘大小",
         "分区配置", "分区大小", "可用的接口卡数量", "实物编码", "风扇数量", "FC对端", "是否配光驱", "是否有分区", "是否配磁带机", "HBA卡数量", "主机服务器标识", "型号",
         "安装的磁盘数量", "I / O通道数量", "IP地址", "逻辑CPU数量", "逻辑分区数量", "生产厂商", "满配CPU个数", "满配磁盘个数", "满配内存插槽数量", "内存型号", "内存数量",
         "管理卡交换机端口", "网卡数量", "网络对端", "光口网卡数量", "操作系统", "外系统接口", "口令", "物理CPU数量", "物理内存大小", "电源数量", "项目名称", "维护人",
         "机房位置", "SAN", "服务器类型", "交换机端口", "软件应用", "软件配置", "TPCC值", "已用内存插槽数量", "使用人"]
'''

    # 打开文件
    print("start read")
    df = pd.read_table("c:\\tmp\\20190919-133457-zhanghui.txt",encoding='GBK',low_memory=False)
    #print(df)
    print("start get 10000")
    df1 = df.head(1000)
    print("start save")
    df1.to_excel('c:\\tmp\\output1.xlsx', index=False)
    #sdf

if __name__ == '__main__':
    read()
